# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

str_num = input("Введите трёхзначное число: ")

sum = 0
for i in str_num:
    sum = sum + int(i)

print(sum)
